FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ns_ЛичныеВещи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_ЛичныеВещи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AdStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllowEmail</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AllowEmail</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Apparel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_Apparel</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ApparelType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ApparelType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvitoId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_Category</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Condition</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ConditionЛичныеВещиНовое</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContactMethod</Name>
					<Comment>Способ связи</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ContactMethod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateBegin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoodsType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_GoodsType_ЛичныеВещи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Comment>Уникальный идентификатор объявления в вашей базе данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ListingFee</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ListingFee</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nsDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Size</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VideoURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныОбъявлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныЗаголовков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/ns_ЛичныеВещи/Ext/Module.bsl
// Область GoodsType
Функция ЗаполнитьСправочникGoodsType() Экспорт
	Попытка
		НачатьТранзакцию();
		
		НайтиИДобавитьЭлементыGoodsType("Одежда, обувь, аксессуары", ПолучитьGoodsType_ОдеждаОбувьАксессуары());
		НайтиИДобавитьЭлементыGoodsType("Детская одежда и обувь", ПолучитьGoodsType_ДетскаяОдеждаИОбувь());
		НайтиИДобавитьЭлементыGoodsType("Товары для детей и игрушки", ПолучитьGoodsType_ТоварыДляДетейИИгрушки());
		НайтиИДобавитьЭлементыGoodsType("Часы и украшения", ПолучитьGoodsType_ЧасыИУкрашения());
		НайтиИДобавитьЭлементыGoodsType("Красота и здоровье", ПолучитьGoodsType_КрасотаИЗдоровье());
		
		ЗафиксироватьТранзакцию();		
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли; 
	    ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
	КонецПопытки; 
	
КонецФункции

Процедура НайтиИДобавитьЭлементыGoodsType(ИмяВладелеца, СписокGoodsType)
	Категория = Справочники.ns_Category.НайтиПоНаименованию(ИмяВладелеца);
    Если Категория.Пустая() Тогда
		Возврат;
	КонецЕсли;  
	
	Для каждого Элемент Из СписокGoodsType Цикл
		НайтиИДобавитьЭлементGoodsType(Элемент, Категория);
	КонецЦикла;
КонецПроцедуры

Процедура НайтиИДобавитьЭлементGoodsType(Наименование, Владелец)
	Элемент = Справочники.ns_GoodsType_ЛичныеВещи.НайтиПоНаименованию(Наименование,,, Владелец);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		Элемент = Справочники.ns_GoodsType_ЛичныеВещи.СоздатьЭлемент();
		Элемент.Владелец = Владелец; 
		Элемент.Наименование = Наименование;
		Элемент.Записать();
	КонецЕсли; 
КонецПроцедуры

Функция ПолучитьGoodsType_ОдеждаОбувьАксессуары()
	Список = Новый Массив;
	Список.Добавить("Женская одежда");
	Список.Добавить("Мужская одежда");
	Список.Добавить("Аксессуары");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_ДетскаяОдеждаИОбувь()
	Список = Новый Массив;
	Список.Добавить("Для девочек");
	Список.Добавить("Для мальчиков");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_ТоварыДляДетейИИгрушки()
	Список = Новый Массив;
	Список.Добавить("Автомобильные кресла");
	Список.Добавить("Велосипеды и самокаты");
	Список.Добавить("Детская мебель");
	Список.Добавить("Детские коляски");
	Список.Добавить("Игрушки");
	Список.Добавить("Постельные принадлежности");
	Список.Добавить("Товары для кормления");
	Список.Добавить("Товары для купания");
	Список.Добавить("Товары для школы");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_ЧасыИУкрашения()
	Список = Новый Массив;
	Список.Добавить("Бижутерия");
	Список.Добавить("Часы");
	Список.Добавить("Ювелирные изделия");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_КрасотаИЗдоровье()
	Список = Новый Массив;
	Список.Добавить("Косметика");
	Список.Добавить("Парфюмерия");
	Список.Добавить("Приборы и аксессуары");
	Список.Добавить("Средства гигиены");
	Список.Добавить("Средства для волос");
	Список.Добавить("Медицинские изделия");
	Список.Добавить("Биологически активные добавки");
	
	Возврат Список;
КонецФункции

// КонецОбласти

// Область Apparel

Функция ЗаполнитьСправочникApparel() Экспорт
	Попытка
		НачатьТранзакцию();
		
		НайтиИДобавитьЭлементыApparel("Женская одежда", ПолучитьApparel_ЖенскаяОдежда());
		НайтиИДобавитьЭлементыApparel("Мужская одежда", ПолучитьApparel_МужскаяОдежда());
		НайтиИДобавитьЭлементыApparel("Аксессуары", ПолучитьApparel_Аксессуары());
		НайтиИДобавитьЭлементыApparel("Для девочек", ПолучитьApparel_ДляДевочек());
		
		ЗафиксироватьТранзакцию();		
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли; 
	    ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
	КонецПопытки; 
	
КонецФункции

Функция ПолучитьApparel_ЖенскаяОдежда()
	Список = Новый Массив;
	Список.Добавить("Брюки");
	Список.Добавить("Верхняя одежда");
	Список.Добавить("Джинсы");
	Список.Добавить("Купальники");
	Список.Добавить("Нижнее бельё");
	Список.Добавить("Обувь");
	Список.Добавить("Пиджаки и костюмы");
	Список.Добавить("Платья и юбки");
	Список.Добавить("Рубашки и блузки");
	Список.Добавить("Свадебные платья");
	Список.Добавить("Топы и футболки");
	Список.Добавить("Трикотаж");
	Список.Добавить("Другое");
	
	Возврат Список;
КонецФункции

Функция ПолучитьApparel_МужскаяОдежда()
	Список = Новый Массив;
	Список.Добавить("Брюки");
	Список.Добавить("Верхняя одежда");
	Список.Добавить("Джинсы");
	Список.Добавить("Обувь");
	Список.Добавить("Пиджаки и костюмы");
	Список.Добавить("Рубашки");
	Список.Добавить("Трикотаж и футболки");
	Список.Добавить("Другое");
	
	Возврат Список;
КонецФункции

Функция ПолучитьApparel_Аксессуары()
	Список = Новый Массив;
	Список.Добавить("Сумки");
	Список.Добавить("Рюкзаки");
	Список.Добавить("Головные уборы");
	Список.Добавить("Чемоданы и дорожные сумки");
	Список.Добавить("Платки и шарфы");
	Список.Добавить("Кошельки, визитницы, ключницы");
	Список.Добавить("Очки");
	Список.Добавить("Ремни, пояса, подтяжки");
	Список.Добавить("Перчатки и варежки");
	Список.Добавить("Украшения");
	Список.Добавить("Портфели и борсетки");
	Список.Добавить("Носки, чулки, колготки");
	Список.Добавить("Зонты");
	Список.Добавить("Обложки для документов");
	Список.Добавить("Аксессуары для волос");
	Список.Добавить("Косметички и бьюти–кейсы");
	Список.Добавить("Галстуки и бабочки");
	Список.Добавить("Другое");
	
	Возврат Список;
КонецФункции

Функция ПолучитьApparel_ДляДевочек()
	Список = Новый Массив;
	Список.Добавить("Брюки");
	Список.Добавить("Верхняя одежда");
	Список.Добавить("Комбинезоны и боди");
	Список.Добавить("Обувь");
	Список.Добавить("Пижамы");
	Список.Добавить("Платья и юбки");
	Список.Добавить("Трикотаж");
	Список.Добавить("Шапки, варежки, шарфы");
	Список.Добавить("Другое");
	
	Возврат Список;
КонецФункции

Процедура НайтиИДобавитьЭлементыApparel(ИмяВладелеца, СписокApparel)
	ВидТовара = Справочники.ns_GoodsType_ЛичныеВещи.НайтиПоНаименованию(ИмяВладелеца);
    Если ВидТовара.Пустая() Тогда
		Возврат;
	КонецЕсли;  
	
	Для каждого Элемент Из СписокApparel Цикл
		НайтиИДобавитьЭлементApparel(Элемент, ВидТовара);
	КонецЦикла;
КонецПроцедуры

Процедура НайтиИДобавитьЭлементApparel(Наименование, Владелец)
	Элемент = Справочники.ns_Apparel.НайтиПоНаименованию(Наименование,,, Владелец);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		Элемент = Справочники.ns_Apparel.СоздатьЭлемент();
		Элемент.Владелец = Владелец; 
		Элемент.Наименование = Наименование;
		Элемент.Записать();
	КонецЕсли; 
КонецПроцедуры

// КонецОбласти 

// Область ApparelType

Функция ЗаполнитьСправочникApparelType() Экспорт
	Попытка
		НачатьТранзакцию();
		
		НайтиИДобавитьЭлементыApparelType("Женская одежда", "Верхняя одежда",	ПолучитьApparelType_ЖенскаяОдежда_ВерхняяОдежда());
		НайтиИДобавитьЭлементыApparelType("Женская одежда", "Обувь", 			ПолучитьApparelType_ЖенскаяОдежда_Обувь());
		НайтиИДобавитьЭлементыApparelType("Мужская одежда", "Верхняя одежда",	ПолучитьApparelType_МужскаяОдежда_ВерхняяОдежда());
		НайтиИДобавитьЭлементыApparelType("Мужская одежда", "Обувь",			ПолучитьApparelType_МужскаяОдежда_Обувь());
		
		ЗафиксироватьТранзакцию();		
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли; 
	    ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
	КонецПопытки; 
	
КонецФункции

Функция ПолучитьApparelType_ЖенскаяОдежда_ВерхняяОдежда()
	Список = Новый Массив;
	Список.Добавить("Шубы");
	Список.Добавить("Пальто");
	Список.Добавить("Зимние куртки и пуховики");
	Список.Добавить("Демисезонные куртки");
	Список.Добавить("Плащи и тренчи");
	Список.Добавить("Парки");
	Список.Добавить("Жилеты");
	Список.Добавить("Джинсовые куртки");
	Список.Добавить("Лёгкие куртки и ветровки");
	Список.Добавить("Дублёнки");
	Список.Добавить("Кожаные куртки");
	Список.Добавить("Косухи");
	Список.Добавить("Бомберы");
	Список.Добавить("Пончо");
	Список.Добавить("Анораки");
	Список.Добавить("Другое");
	
	Возврат Список;
КонецФункции

Функция ПолучитьApparelType_ЖенскаяОдежда_Обувь()
	Список = Новый Массив;
	Список.Добавить("Туфли");
	Список.Добавить("Сапоги");
	Список.Добавить("Босоножки");
	Список.Добавить("Ботильоны");
	Список.Добавить("Ботинки и полуботинки");
	Список.Добавить("Кроссовки и кеды");
	Список.Добавить("Полусапоги");
	Список.Добавить("Балетки");
	Список.Добавить("Угги, валенки, дутики");
	Список.Добавить("Сабо и мюли");
	Список.Добавить("Резиновая обувь");
	Список.Добавить("Мокасины и лоферы");
	Список.Добавить("Сандалии");
	Список.Добавить("Шлёпанцы и сланцы");
	Список.Добавить("Домашняя обувь");
	Список.Добавить("Спортивная обувь");
	Список.Добавить("Слипоны и эспадрильи");
	Список.Добавить("Уход за обувью");
	
	Возврат Список;
КонецФункции

Функция ПолучитьApparelType_МужскаяОдежда_ВерхняяОдежда()
	Список = Новый Массив;
	Список.Добавить("Зимние куртки и пуховики");
	Список.Добавить("Лёгкие куртки и ветровки");
	Список.Добавить("Демисезонные куртки");
	Список.Добавить("Пальто");
	Список.Добавить("Дублёнки и шубы");
	Список.Добавить("Жилеты");
	Список.Добавить("Парки");
	Список.Добавить("Джинсовые куртки");
	Список.Добавить("Кожаные куртки");
	Список.Добавить("Бомберы");
	Список.Добавить("Плащи и тренчи");
	Список.Добавить("Косухи");
	Список.Добавить("Анораки");
	Список.Добавить("Другое");
	
	Возврат Список;
КонецФункции

Функция ПолучитьApparelType_МужскаяОдежда_Обувь()
	Список = Новый Массив;
	Список.Добавить("Кроссовки");
	Список.Добавить("Ботинки и полуботинки");
	Список.Добавить("Туфли");
	Список.Добавить("Кеды");
	Список.Добавить("Сапоги и полусапоги");
	Список.Добавить("Мокасины и лоферы");
	Список.Добавить("Спортивная обувь");
	Список.Добавить("Угги, валенки, дутики");
	Список.Добавить("Рабочая обувь");
	Список.Добавить("Резиновая обувь");
	Список.Добавить("Сандалии");
	Список.Добавить("Шлёпанцы и сланцы");
	Список.Добавить("Домашняя обувь");
	Список.Добавить("Слипоны и эспадрильи");
	Список.Добавить("Уход за обувью");
	
	Возврат Список;
КонецФункции

Процедура НайтиИДобавитьЭлементыApparelType(ИмяВладелецаApparel, ИмяВладелеца, СписокApparelType)
	ВидТовара = Справочники.ns_GoodsType_ЛичныеВещи.НайтиПоНаименованию(ИмяВладелецаApparel);
    Если ВидТовара.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПредметОдежды = Справочники.ns_Apparel.НайтиПоНаименованию(ИмяВладелеца,,, ВидТовара);
    Если ПредметОдежды.Пустая() Тогда
		Возврат;
	КонецЕсли;  
	
	Для каждого Элемент Из СписокApparelType Цикл
		НайтиИДобавитьЭлементApparelType(Элемент, ПредметОдежды);
	КонецЦикла;
КонецПроцедуры

Процедура НайтиИДобавитьЭлементApparelType(Наименование, Владелец)
	Элемент = Справочники.ns_ApparelType.НайтиПоНаименованию(Наименование,,, Владелец);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		Элемент = Справочники.ns_ApparelType.СоздатьЭлемент();
		Элемент.Владелец = Владелец; 
		Элемент.Наименование = Наименование;
		Элемент.Записать();
	КонецЕсли; 
КонецПроцедуры

// КонецОбласти 

// Область Size

Функция ПолучитьSize_ЖенскаяОдежда() Экспорт
	СписокSize = Новый Массив;
	
	СписокSize.Добавить("38 (XXS)");
	СписокSize.Добавить("40 (XS)");
	СписокSize.Добавить("42 (S)");
	СписокSize.Добавить("44 (S/M)");
	СписокSize.Добавить("46 (M)");
	СписокSize.Добавить("48 (L)");
	СписокSize.Добавить("50 (L/XL)");
	СписокSize.Добавить("52 (XL)");
	СписокSize.Добавить("54 (XXL)");
	СписокSize.Добавить("56 (3XL)");
	СписокSize.Добавить("58 (4XL)");
	СписокSize.Добавить("60 (5XL)");
	СписокSize.Добавить("62 (5XL)");
	СписокSize.Добавить("64 (6XL)");
	СписокSize.Добавить("66 (6XL)");
	СписокSize.Добавить("68 (7XL)");
	СписокSize.Добавить("70 (7XL)");
	СписокSize.Добавить("72 (8XL)");
	СписокSize.Добавить("74 (8XL)");
	СписокSize.Добавить("76 (8XL)");
	СписокSize.Добавить("78 (8XL) и больше");
	СписокSize.Добавить("Без размера");
	
	Возврат СписокSize;
КонецФункции
 
Функция ПолучитьSize_МужскаяОдежда() Экспорт
	СписокSize = Новый Массив;
	
	СписокSize.Добавить("40 (XXS)");
	СписокSize.Добавить("42 (XS)");
	СписокSize.Добавить("44 (XS/S)");
	СписокSize.Добавить("46 (S)");
	СписокSize.Добавить("48 (M)");
	СписокSize.Добавить("50 (L)");
	СписокSize.Добавить("52 (L/XL)");
	СписокSize.Добавить("54 (XL)");
	СписокSize.Добавить("56 (XXL)");
	СписокSize.Добавить("58 (XXL)");
	СписокSize.Добавить("60 (3XL)");
	СписокSize.Добавить("62 (4XL)");
	СписокSize.Добавить("64 (5XL)");
	СписокSize.Добавить("66 (6XL)");
	СписокSize.Добавить("68 (7XL)");
	СписокSize.Добавить("70 (7XL)");
	СписокSize.Добавить("72 (8XL)");
	СписокSize.Добавить("74 (8XL)");
	СписокSize.Добавить("76 (9XL)");
	СписокSize.Добавить("78 (10XL)");
	СписокSize.Добавить("80 (10XL)");
	СписокSize.Добавить("82 (10XL) и больше");
	СписокSize.Добавить("Без размера");
	
	Возврат СписокSize;
КонецФункции

Функция ПолучитьSize_ЖенскаяОдежда_Джинсы() Экспорт
	СписокSize = Новый Массив;
	
	СписокSize.Добавить("36–38 (W23), 36, W23, W23/L28, W23/L30, W23/L32, W23/L34, W23/L36, 36-38 (W23)");
	СписокSize.Добавить("38 (W24), 38, W24, W24/L28, W24/L30, W24/L32, W24/L34, W24/L36");
	СписокSize.Добавить("40 (W25), 40, W25, W25/L28, W25/L30, W25/L32, W25/L34, W25/L36");
	СписокSize.Добавить("42 (W26), 42, W26, W26/L28, W26/L30, W26/L32, W26/L34, W26/L36");
	СписокSize.Добавить("42–44 (W27), 42, W27, W27/L28, W27/L30, W27/L32, W27/L34, W27/L36, 42-44 (W27)");
	СписокSize.Добавить("44 (W28), 44, W28, W28/L28, W28/L30, W28/L32, W28/L34, W28/L36");
	СписокSize.Добавить("44–46 (W29), W29, W29/L28, W29/L30, W29/L32, W29/L34, W29/L36, 44-46 (W29)");
	СписокSize.Добавить("46 (W30), 46, W30, W30/L28, W30/L30, W30/L32, W30/L34, W30/L36");
	СписокSize.Добавить("46–48 (W31), W31, W31/L28, W31/L30, W31/L32, W31/L34, W31/L36, 46-48 (W31)");
	СписокSize.Добавить("48 (W32), 48, W32, W32/L28, W32/L30, W32/L32, W32/L34, W32/L36");
	СписокSize.Добавить("48–50 (W33), W33, W33/L28, W33/L30, W33/L32, W33/L34, W33/L36, 48-50 (W33)");
	СписокSize.Добавить("50 (W34), 50, W34, W34/L28, W34/L30, W34/L32, W34/L34, W34/L36");
	СписокSize.Добавить("50–52 (W35), W35, W35/L28, W35/L30, W35/L32, W35/L34, W35/L36, 50-52 (W35)");
	СписокSize.Добавить("52 (W36), 52, W36, W36/L28, W36/L30, W36/L32, W36/L34, W36/L36");
	СписокSize.Добавить("54 (W38), 54, W38, W38/L28, W38/L30, W38/L32, W38/L34, W38/L36");
	СписокSize.Добавить("58 (W40), 58, W40, W40/L28, W40/L30, W40/L32, W40/L34, W40/L36");
	СписокSize.Добавить("62 (W42), 62, W42, W42/L28, W42/L30, W42/L32, W42/L34, W42/L36");
	СписокSize.Добавить("64 (W44) и больше, 64, W44/L28, W44/L30, W44/L32, W44/L34, W44/L36, 66, 68, W46/L28, W46/L30, W46/L32, W46/L34, W46/L36, W48/L28, W48/L30, W48/L32, W48/L34, W48/L36");
	
	Возврат СписокSize;
КонецФункции
 
Функция ПолучитьSize_МужскаяОдежда_Джинсы() Экспорт
	СписокSize = Новый Массив;
	
	СписокSize.Добавить("44 (W28), 44, W28, W28/L28, W28/L30, W28/L32, W28/L34, W28/L36");
	СписокSize.Добавить("44–46 (W29), W29, W29/L28, W29/L30, W29/L32, W29/L34, W29/L36");
	СписокSize.Добавить("46 (W30), 46, W30, W30/L28, W30/L30, W30/L32, W30/L34, W30/L36");
	СписокSize.Добавить("46–48 (W31), W31, W31/L28, W31/L30, W31/L32, W31/L34, W31/L36");
	СписокSize.Добавить("48 (W32), 48, W32, W32/L28, W32/L30, W32/L32, W32/L34, W32/L36");
	СписокSize.Добавить("48–50 (W33), W33, W33/L28, W33/L30, W33/L32, W33/L34, W33/L36");
	СписокSize.Добавить("50 (W34), 50, W34, W34/L28, W34/L30, W34/L32, W34/L34, W34/L36");
	СписокSize.Добавить("50–52 (W35), W35, W35/L28, W35/L30, W35/L32, W35/L34, W35/L36");
	СписокSize.Добавить("52 (W36), 52, W36, W36/L28, W36/L30, W36/L32, W36/L34, W36/L36");
	СписокSize.Добавить("54 (W38), 54, W38, W38/L28, W38/L30, W38/L32, W38/L34, W38/L36");
	СписокSize.Добавить("58 (W40), 58, W40, W40/L28, W40/L30, W40/L32, W40/L34, W40/L36");
	СписокSize.Добавить("62 (W42), 62, W42, W42/L28, W42/L30, W42/L32, W42/L34, W42/L36");
	СписокSize.Добавить("64 (W44) и больше, 64, W44/L28, W44/L30, W44/L32, W44/L34, W44/L36, 66, 68, W46/L28, W46/L30, W46/L32, W46/L34, W46/L36, W48/L28, W48/L30, W48/L32, W48/L34, W48/L36");
	
	Возврат СписокSize;
КонецФункции

Функция ПолучитьSize_ЖенскаяОдежда_Обувь() Экспорт
	СписокSize = Новый Массив;
	
	СписокSize.Добавить("34");
	СписокSize.Добавить("34,5");
	СписокSize.Добавить("35");
	СписокSize.Добавить("35,5");
	СписокSize.Добавить("36");
	СписокSize.Добавить("36,5");
	СписокSize.Добавить("37");
	СписокSize.Добавить("37,5");
	СписокSize.Добавить("38");
	СписокSize.Добавить("38,5");
	СписокSize.Добавить("39");
	СписокSize.Добавить("39,5");
	СписокSize.Добавить("40");
	СписокSize.Добавить("40,5");
	СписокSize.Добавить("41");
	СписокSize.Добавить("41,5");
	СписокSize.Добавить("42");
	СписокSize.Добавить("42,5");
	СписокSize.Добавить("43");
	СписокSize.Добавить("43,5");
	СписокSize.Добавить("44 и больше");
	
	Возврат СписокSize;
КонецФункции
 
Функция ПолучитьSize_МужскаяОдежда_Обувь() Экспорт
	СписокSize = Новый Массив;
	
	СписокSize.Добавить("36");
	СписокSize.Добавить("36,5");
	СписокSize.Добавить("37");
	СписокSize.Добавить("37,5");
	СписокSize.Добавить("38");
	СписокSize.Добавить("38,5");
	СписокSize.Добавить("39");
	СписокSize.Добавить("39,5");
	СписокSize.Добавить("40");
	СписокSize.Добавить("40,5");
	СписокSize.Добавить("41");
	СписокSize.Добавить("41,5");
	СписокSize.Добавить("42");
	СписокSize.Добавить("42,5");
	СписокSize.Добавить("43");
	СписокSize.Добавить("43,5");
	СписокSize.Добавить("44");
	СписокSize.Добавить("44,5");
	СписокSize.Добавить("45");
	СписокSize.Добавить("45,5");
	СписокSize.Добавить("46");
	СписокSize.Добавить("46,5");
	СписокSize.Добавить("47");
	СписокSize.Добавить("47,5");
	СписокSize.Добавить("48 и больше");
	
	Возврат СписокSize;
КонецФункции

Функция ПолучитьSize_ДляДевочекИМальчиков() Экспорт
	СписокSize = Новый Массив;
	
	СписокSize.Добавить("50 см (1 месяц), 50, 1 месяц, 1 мес");
	СписокSize.Добавить("56 см (2 месяца), 56, 2 месяца, 2 мес");
	СписокSize.Добавить("62 см (3 месяца), 62, 3 месяца, 3 мес");
	СписокSize.Добавить("68 см (6 месяцев), 68, 6 месяцев, 6 мес");
	СписокSize.Добавить("74 см (9 месяцев), 74, 9 месяцев, 9 мес");
	СписокSize.Добавить("80 см (12 месяцев), 80, 12 месяцев, 12 мес");
	СписокSize.Добавить("86 см (18 месяцев), 86, 18 месяцев, 18 мес");
	СписокSize.Добавить("92 см (2 года), 92, 2 года");
	СписокSize.Добавить("98 см (3 года), 98, 3 года");
	СписокSize.Добавить("104 см (4 года), 104, 4 года");
	СписокSize.Добавить("110 см (5 лет), 110, 5 лет");
	СписокSize.Добавить("116 см (6 лет), 116, 6 лет");
	СписокSize.Добавить("122 см (7 лет), 122, 7 лет");
	СписокSize.Добавить("128 см (8 лет), 128, 8 лет");
	СписокSize.Добавить("134 см (9 лет), 134, 9 лет");
	СписокSize.Добавить("140 см (10 лет), 140, 10 лет");
	СписокSize.Добавить("146 см (11 лет), 146, 11 лет");
	СписокSize.Добавить("152 см (12 лет), 152, 12 лет");
	СписокSize.Добавить("158 см (13 лет), 158, 13 лет");
	СписокSize.Добавить("164 см (14 лет), 164, 14 лет");
	СписокSize.Добавить("170 см (15 лет), 170, 15 лет");
	СписокSize.Добавить("Без размера");
	
	Возврат СписокSize;
КонецФункции

Функция ПолучитьSize_ДляДевочекИМальчиков_Обувь() Экспорт
	СписокSize = Новый Массив;
	
	СписокSize.Добавить("16 (9,5 см)");
	СписокSize.Добавить("16,5 (10 см)");
	СписокSize.Добавить("17 (10,5 см)");
	СписокSize.Добавить("18 (11 см)");
	СписокSize.Добавить("19 (11,5 см)");
	СписокSize.Добавить("19,5 (12 см)");
	СписокSize.Добавить("20 (12,5 см)");
	СписокSize.Добавить("21 (13 см)");
	СписокSize.Добавить("22 (13,5 см)");
	СписокSize.Добавить("22,5 (14 см)");
	СписокSize.Добавить("23 (14,5 см)");
	СписокSize.Добавить("24 (15 см)");
	СписокSize.Добавить("25 (15,5 см)");
	СписокSize.Добавить("25,5 (16 см)");
	СписокSize.Добавить("26 (16,5 см)");
	СписокSize.Добавить("27 (17 см)");
	СписокSize.Добавить("28 (17,5 см)");
	СписокSize.Добавить("28,5 (18 см)");
	СписокSize.Добавить("29 (18,5 см)");
	СписокSize.Добавить("30 (19 см)");
	СписокSize.Добавить("31 (19,5 см)");
	СписокSize.Добавить("31,5 (20 см)");
	СписокSize.Добавить("32 (20,5 см)");
	СписокSize.Добавить("33 (21 см)");
	СписокSize.Добавить("34 (21,5 см)");
	СписокSize.Добавить("34,5 (22 см)");
	СписокSize.Добавить("35 (22,5 см)");
	СписокSize.Добавить("36 (23 см)");
	СписокSize.Добавить("37 (23,5 см)");
	СписокSize.Добавить("37,5 (24 см)");
	СписокSize.Добавить("38 (24,5 см)");
	СписокSize.Добавить("39 (25 см)");
	СписокSize.Добавить("40 (25,5 см)");
	СписокSize.Добавить("40,5 (26 см)");
	СписокSize.Добавить("41 (26,5 см)");
	СписокSize.Добавить("42 (27 см)");
	СписокSize.Добавить("43 (27,5 см)");
	СписокSize.Добавить("43,5 (28 см)");
	СписокSize.Добавить("44 (28,5 см)");
	
	Возврат СписокSize;
КонецФункции

//КонецОбласти 

Функция СправочникЛичныеВещиСопоставлен() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ns_ЛичныеВещи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_ЛичныеВещи КАК ns_ЛичныеВещи";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
КонецФункции

// Область Выгрузка

Функция ПолучитьДанныеНоменклатуры(МагазинСтрока) Экспорт 
	Если ns_ОбщегоНазначенияПовтИсп.ПолучитьДобавлятьIDКатегории() Тогда
		Префикс = "pers-" + Строка(МагазинСтрока.Магазин.Префикс) + "-";
	Иначе
		Префикс = Строка(МагазинСтрока.Магазин.Префикс);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ЛичныеВещи.Номенклатура КАК Номенклатура,
	|	ns_ЛичныеВещи.Title КАК Title,
	|	ns_ЛичныеВещи.AdStatus КАК AdStatus,
	|	ns_ЛичныеВещи.AllowEmail КАК AllowEmail,
	|	ns_ЛичныеВещи.AvitoId КАК AvitoId,
	|	ns_ЛичныеВещи.Category КАК Category,
	|	ns_ЛичныеВещи.GoodsType КАК GoodsType,
	|	ns_ЛичныеВещи.DateBegin КАК DateBegin,
	|	ns_ЛичныеВещи.DateEnd КАК DateEnd,
	|	&Префикс + ns_ЛичныеВещи.Id КАК Id,
	|	ns_ЛичныеВещи.ListingFee КАК ListingFee,
	|	ns_ЛичныеВещи.nsDescription КАК nsDescription,
	|	ns_ЛичныеВещи.VideoURL КАК VideoURL,
	|	ns_ЛичныеВещи.Шаблон КАК Шаблон,
	|	0 КАК Price,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(17)) КАК ContactPhone,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(40)) КАК ManagerName,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК Address,
	|	ns_ЛичныеВещи.Артикул КАК Артикул,
	|	ns_ЛичныеВещи.Наименование КАК Наименование,
	|	ns_ЛичныеВещи.Характеристика КАК Характеристика,
	|	ns_ЛичныеВещи.Ссылка КАК Ссылка,
	|	ns_ЛичныеВещи.Condition КАК Condition,
	|	ns_ЛичныеВещи.AdType КАК AdType,
	|	ns_ЛичныеВещи.Apparel КАК Apparel,
	|	ns_ЛичныеВещи.ApparelType КАК ApparelType,
	|	ns_ЛичныеВещи.Size КАК Size
	|ИЗ
	|	Справочник.ns_ЛичныеВещи КАК ns_ЛичныеВещи
	|ГДЕ
	|	ns_ЛичныеВещи.ЭтоГруппа = ЛОЖЬ
	|	И ns_ЛичныеВещи.Выгружать = ИСТИНА";
	Запрос.УстановитьПараметр("Префикс", Префикс);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

// Область Выгрузка

//Область Сопоставление

Процедура Сопоставить(Ссылка, Характеристика, Родитель, ТаблицаСопоставления) Экспорт
	Изменен = Истина;
	
	СсылкаНаЭлемент = ns_Сопоставление.НайтиСопоставление(Ссылка, Характеристика, ТаблицаСопоставления);
	Если СсылкаНаЭлемент = Неопределено Тогда
		ОбъектЭлемент = Справочники.ns_ЛичныеВещи.СоздатьЭлемент();
		ОбъектЭлемент.Номенклатура = Ссылка;
		Если ЗначениеЗаполнено(Характеристика) Тогда
			ОбъектЭлемент.Характеристика = Характеристика;
			Id = Строка(Ссылка.УникальныйИдентификатор()) + "#" + Строка(Характеристика.УникальныйИдентификатор());
		Иначе
			Id = Строка(Ссылка.УникальныйИдентификатор());
		КонецЕсли; 
		ОбъектЭлемент.Id = Id;
		ОбъектЭлемент.Выгружать = ns_ОбщегоНазначенияПовтИсп.ПолучитьДобавлятьВВыгрузку();
		ОбъектЭлемент.Condition = ns_ОбщегоНазначенияПовтИсп.ПолучитьConditionЛичныеВещи();
		ОбъектЭлемент.AdType = ns_ОбщегоНазначенияПовтИсп.ПолучитьAdType();
		
		Изменен = Истина;
	Иначе
		ОбъектЭлемент = СсылкаНаЭлемент.ПолучитьОбъект();
	КонецЕсли; 
	
	ns_Сопоставление.ЗаполнитьTitle(ОбъектЭлемент);
	ns_Сопоставление.ЗаполнитьDescription(Ссылка, ОбъектЭлемент);
	
	ОбъектЭлемент.ПометкаУдаления = Ссылка.ПометкаУдаления;
	ОбъектЭлемент.Наименование = Ссылка.Наименование;
	ОбъектЭлемент.Артикул = Ссылка.Артикул;
	ОбъектЭлемент.Родитель = Справочники.ns_ЛичныеВещи.ПолучитьСсылку(Родитель.УникальныйИдентификатор());
	
	Если Изменен Тогда
		ОбъектЭлемент.Записать();
	КонецЕсли; 
	
КонецПроцедуры

Процедура СопоставитьЭлементНоменклатуры(Ссылка) Экспорт
	ns_Сопоставление.СопоставитьЭлементНоменклатуры(Ссылка, "ns_ЛичныеВещи");			
КонецПроцедуры
 
//КонецОбласти
